{"meta":{"title":"伏特","subtitle":"Volt","description":"From Chengdu No.7 High School","author":"Team-1387","url":"http://yoursite.com"},"pages":[{"title":"关于本站","date":"2018-02-16T13:46:17.183Z","updated":"2018-02-16T13:46:17.164Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"关于此网站本网站为成都市第七中学林荫校区机器人社团伏特队官方网站。此网站由伏特队指导老师张庆与教练左德阳管理，前伏特队成员彭思远与伏特队队长吴峻宜开发设计。 About this PageThis is the official page of Team Volt (#1387) of Robotics Club from Chengdu No.7 High school. This website was controled by supervisor Qin Zhang and Coach Deyang Zuo, developed and designed by former team member Siyuan Peng and team leader Junyi Wu. 联系我们您可以通过伏特队队长邮箱或指导老师张老师邮箱联系成都七中 FTC 伏特队。 Contact usYou can contact us via E-mail either our team leader or our supervisor."},{"title":"tags","date":"2017-11-09T16:00:00.000Z","updated":"2018-02-16T13:34:47.924Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"All tags","date":"2018-02-03T06:39:36.913Z","updated":"2018-02-03T06:38:10.484Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"成都七中 FTC 伏特队欢迎你！","slug":"how-to","date":"2018-02-16T13:11:37.611Z","updated":"2018-02-16T13:36:11.016Z","comments":true,"path":"2018/02/16/how-to/","link":"","permalink":"http://yoursite.com/2018/02/16/how-to/","excerpt":"","text":"又到了一年的招新时，希望同学们多多了解我们社团！ 想加入我们的同学一定很想了解一台机器是如何搭建出来的？ 首先是设计，如果你负责设计，你会学会CAD，学会建模。你也会学到机械结构方面的知识比如擒纵结构、棘轮、蜗轮结构这些听起来就很高大上的东西。 之后，便是搭建了。机器人搭建有一个最大的梗就是电锯。这个初来看着很吓人，后来看着很可爱的东西，你们以后会用的愉快的。而什么螺刀扳手，各色螺丝垫圈轴承，从此不在话下。 搭建的同时，也会开始编写程序。很开心，你能用上死循环。你也会学到闭环、PID等神奇的东西。还会对涉及电学的PWM，涉及光学的各种传感器有所了解。你会写一个个完成任务，辅助操作的自动程序。 最后就是操作了。朋友你喜欢游戏吗？朋友你喜欢手柄吗？在鸡舍你能在上学期间光明正大的用 xbox 的手柄操作机器人。据这届的操作手说：打得好主机游戏的人，一定不会是一个差的操作手。 机器搭建完了，我们还有好多成员还有更特别的工作，外联。外联——每一个社团都有的组织。机器人的外联，独特在于，主要是在国外比赛的时候，你可以勾搭到很多国外大佬和帅气的小姐姐们。嘿嘿，我们的外联其实主要负责联系其他队伍，进行技术沟通交流或者约个时间打打友谊赛，这些都是外联的工作。 这就是一台机器的成型过程。这样下来，也分出了我们战队每个成员的工作。设计，搭建，编程，操作，外联。 上面说了很多但他们只是机器人社最平凡的一部分，而机器人是一项团队活动。在这里，你会见到一个真正的团队，大家站在一起，为同一个目标倾尽全力。相互理解，彼此支持。我所在的队里，会有不同意见，但从未有争吵。在这样的团队里，哪怕你做错了，给大家带来了失败。也不会有人责备你，抱怨你，他们会笑笑，总结教训，下次再来。来机器人社吧，刚开始，你会收获一群队友，后来啊，你会收获一群朋友，走到最后，你会收获一群陪你笑陪你哭的傻逼们。最后，哪怕你从没有接触过任何机器人相关，哪怕你没有一点基础，哪怕你什么都不会，只要你有热情，只要你有兴趣，机器人社都欢迎你的到来。 来机器人社吧， 刚开始，你会收获一群队友； 后来啊，你会收获一群朋友； 走到最后，你会收获一群陪你笑陪你哭的傻逼们，那是最真挚的友谊。 无论你是谁 哪怕零基础，零经验， 只要你有热情，我们等你来!","categories":[{"name":"宣传","slug":"宣传","permalink":"http://yoursite.com/categories/宣传/"}],"tags":[{"name":"宣传","slug":"宣传","permalink":"http://yoursite.com/tags/宣传/"}]},{"title":"伏特队名由来","slug":"story-of-volt","date":"2018-02-05T09:13:01.000Z","updated":"2018-02-16T09:49:50.468Z","comments":true,"path":"2018/02/05/story-of-volt/","link":"","permalink":"http://yoursite.com/2018/02/05/story-of-volt/","excerpt":"","text":"作者：吴峻宜（2017-18赛季 FTC 1387伏特队队长） 早在2017年，张老就叫我们想队名。 当时的我们，脑子里蹦出了很多骚想法，因为高一嘛，学到了集合，所以李亦非大叫道：“我们用「左闭右开增区间」”吧！刚好七个字！”我们想了想，觉得头头是道啊，便告诉张老，张老愣了一下，没有表态，但看起来不支持，他接下来便给我们列举了许多前辈的队名，比如啊「宫保鸡丁」「银杏之光」「活化石」等队名，我们觉得都不好，接着便是去年的「伏特」和「坎德拉」了，都是以人名，物理计量单位来的，我们便往那个方向想，接着「阿伏伽德罗」「亚里士多德」之类的诸多骚名字便蹦了出来，紧接，便是大笑，气氛轻松愉悦。便不了了之。 到了今年，2018年的时候，必须要分队，定队名了，就又重新想这个恼人的问题。 两个小时之后……情景便是这样了，每每一个人想出来一个队名，另外的人就立马否决，往复循环。知道张老打破了这个循环：“你们要不要考虑还是用。”他看了看我们，“用去年的队名？”接着又给我们看了一张表格。 是一张去年积分的表格，伏特队和坎德拉队稳居积分榜的一二名，我们心中油然而生出一种强烈的自豪感，这种感觉，真的超赞！我们立马就同意用去年的“伏特”与“坎德拉”。也是一种传承吧。","categories":[{"name":"简介","slug":"简介","permalink":"http://yoursite.com/categories/简介/"}],"tags":[{"name":"伏特的故事","slug":"伏特的故事","permalink":"http://yoursite.com/tags/伏特的故事/"}]},{"title":"创建与发展历史","slug":"team-members","date":"2018-02-05T00:13:02.000Z","updated":"2018-02-16T13:29:50.834Z","comments":true,"path":"2018/02/05/team-members/","link":"","permalink":"http://yoursite.com/2018/02/05/team-members/","excerpt":"","text":"作者：吴峻宜（2017-18赛季 FTC 1387伏特队队长） 我们的荣誉团队荣誉 2016年3月20日，在清华大学举行的2016 FTC机器人科技挑战赛分站赛上，成都七中林荫校区七蝎队三等奖。 2016年4月9日，在重庆大学举行的2016 FTC机器人科技挑战赛分站赛上，成都七中林荫校区七蝎队获得单项奖控制奖。 2016年6月3日-5日，FIRST中国组委会在上海科技馆举办2016 FIRST中国公开赛暨国际邀请赛。来自中国、美国、俄罗斯等国家的53支队伍参加了FTC（FIRST科技挑战赛）“救援团”主题竞赛，七蝎队（7-Scorpion 1211）获得全国一等奖，其中2名同学获得澳大利亚麦考瑞大学招生资格和奖学金。 2017年3月10日，在北京清华大学举行的FIRST机器人科技挑战赛上，我校伏特队（1387）获得三等奖。 2017年4月23日，在上海同济大学举行的FIRST机器人科技挑战赛上，我校伏特队（1387）参赛，以初赛第一名的成绩晋级复赛，最终获得亚军联盟队长。 2017年5月7日，在西安电子科技大学举行的FIRST机器人科技挑战赛上，我校以初赛第一名的成绩进入复赛，伏特队（1387）获得联盟亚军。 2017年5月14日，在重庆大学举行的FIRST机器人科技挑战赛上，伏特队（1387）获得联盟队长、最高单项奖思索奖。参赛队员将获得大学自招优先的机会。 2016-2017赛季，伏特队与坎德拉队分别获得该赛季总积分榜第一第二名。 个人荣誉 2008年成都七中 Vex 世锦赛冠军队队员达兴烨同学，2009年考上上海交通大学，现在普渡大学攻读机器人专业博士学位。 2013年连续参加了两届机器人竞赛的耿昕暘同学被美国加州美国加州大学伯克利分校录取。 2014年，成都七中机器人战队队长罗云鹏同学被清华大学自动化系录取。 我们的队员李亦非​ 一个技术控，精通于结构与搭建，电脑掌握技术十分高超，当然这也包括电脑上的各种游戏，比如坦克世界、吃鸡、特别是MC，红石大佬一枚。在我的世界中做出了各种骚操作，包括各种骚想法，骚炮。也是看得我眼花缭乱。负责结构与搭建，与LOGO的设计和制作海报，也是付出了极大的心思，虽然骚，做的还是强得一批，学习中也是巨擘，大佬，强者。 谭芮鄙人今年就16了（咳咳，可能还有点久），学习能力也就也就一般般，到了鸡舍，也就比较吃亏，学习一个东西时间比较久，特别是记的东西，老夫就彻底凉了。还好有各位大佬的帮助，老夫现在也能做一些比较简单的事了。后来老夫也非常不幸，被选上当操作手，老夫也因此烙下了“左右脑需要开发的名号”。总之，智商低没问题。只要功夫深，铁棒磨成针！ 丁冉Q：今年几岁了？ A：16…比学姐还大了一个月的我… Q：为什么来鸡舍？ A：我能说被骗来的吗… Q：为什么选程序？ A：因为这个“职业”看起来很酷… Q：对鸡舍的印象? A：大家都是大佬，我一个渣渣… Q：鸡舍对你的影响？ A：更懂得了团队协作。 Q：以后会选择有关机器人的专业吗？ A：看情况吧，但会优先考虑吧。 张洁茜Q：多少岁？ A：15 Q：为什么进机社？ A：我能说是个偶然吗，机社的招新海报是吸引我入坑的主要原因。 Q：为什么选择负责程序？ A：嗯……学了一点C++，结果发现机器人的程序是 Java（微笑脸）。 Q：想从事和机器人相关的职业吗？ A：只能说会考虑的。 Q：在机社最大的收获是什么？ A：极大的锻炼了我的自学的能力吧。 Q：打个比方？** A：就说学程序吧，就看学姐留给我们程序员的资料，主要是自己看，不懂的问题问。。。 Q：机社留给你的印象？ A：大佬云集，就是个很 Geek的社团。自己不努力学习各种东西都愧对自己来到这么好的社团啊。 吴峻宜作为高二学长，已经参加过一年FTC的比赛，已经感受过了机器人比赛的险恶，于是今年又来了。今年还是留在了伏特，还是1387，只是今年参赛抱着不一样的心情来参赛，因为我的第一愿望就只有希望机器不断连，然后有大佬能给我们队大腿来抱。 张皓文刚开始来到机社，是想练一下自己的动手能力，还有就是本来在设计与机械方面就比较好，就被机社吸引，来到了这里，但是来到这里以后吧，也有一些与自己想象中的机社不一样的地方。在开始不久，被一个奇怪、匪夷所思的理由被选为做工程笔记，但想想也后悔，因为懒，开始没学 InDesign，工笔做得并不好。但是祸不单行，在一个劣势之后，困难接踵而来。一就是队员不怎么配合，队长也不怎么重视工程笔记，更大的一个因素就是我是操作手！后期的时候，天天就在练操作了，更没有时间做工笔…再看看坎德拉吧，两个人专心做工笔，有一个高二经验丰富的老队员，狂做，还有一个“技术指导”，哇绝望。操作也不理想，还是很慢，有什么办法?练。但确实也尽了全力了，无憾。","categories":[{"name":"简介","slug":"简介","permalink":"http://yoursite.com/categories/简介/"}],"tags":[{"name":"伏特的故事","slug":"伏特的故事","permalink":"http://yoursite.com/tags/伏特的故事/"}]},{"title":"我们是成都七中机器人爱好者协会","slug":"introduction","date":"2018-01-16T12:49:57.000Z","updated":"2018-02-17T03:01:01.294Z","comments":true,"path":"2018/01/16/introduction/","link":"","permalink":"http://yoursite.com/2018/01/16/introduction/","excerpt":"","text":"成都七中机器人爱好者协会作者：吴峻宜（2017-18赛季 FTC 1387伏特队队长）；彭思远（成都七中 FTC 伏特队退役成员） 成都七中机器人爱好者协会成立于2007年，是成都七中为学生机器人爱好者搭建的，旨在提高学生创新能力、动手能力和组织能力的学习交流平台。 我们是一个集动手能力与团队合作的协会机器人爱好者协会亦被许多学生成为机社，饱含着学生对机器人协会的深厚感情。参与到这个协会的学生除了有相应的机器人专业知识，更在这个协会中锻炼了自己的团队精神、自我管理和组织管理能力。我们作为七中获奖最多的协会，我们主要参加「Vex」和「FTC」两个项目，与全国各地的学校同台竞技，也经常代表中国登上世锦赛的舞台。我们通过自己时间的付出和日以继夜的努力，逐渐成为了其他学校眼中的大腿和大佬。这些成绩不仅是对我们的肯定，同时也是我们辛勤付出的结果，有投入才能有收获！ 我们是成都七中最自由的社团我们有最大的活动教室、最轻松和睦的成员关系、最先进的创新理念、最齐全的设备和工具。这样的条件也让我们有能力在全国的舞台上绽放自我。目前成都七中机器人爱好者协会总共有两个机器人竞赛项目，一个是 Vex，另一个则是 FTC（FIRST Tech Challenge） 机器人科技挑战赛。FTC 是由美国FIRST非盈利性机构主办的针对14-18岁高中生的国际性机器人比赛。现今每年约 250,000名高中生参加。FIRST可设计性强、创造性强，基于遥控操作，给学生提供了一个平台，把课堂上的科技概念运用到现实工程师问题解决中 。学生面对无尽挑战，创造特有的解决方案，同时培养团队合作、演讲技能、商业意识。值得一体的是，成都七中机器人爱好者协会的成员除了在机器人竞赛中取得佳绩，学生凭借自己培养出的强大的自我管理能力和学习能力在文化学习上亦保持着优异的成绩。总之，在艰苦的条件和环境中，成都七中机社成员披荆斩棘，自力更生，大胆发挥想象力，在学校的政策大力支持和技术支持和资金支持下，吸取各种优秀的先进的技术资源丰富自我，凭借其艰苦卓绝的奋斗精神在世界机器人竞赛舞台上展露出光芒。 我们有历史悠久经验丰富的战队成都七中机器人爱好者协会成立于2007年，协会社团平时在团队合作中设计搭建机器，然后参加世界各地的各项机器人比赛。而之后，我们也多次在中国的激烈比赛中，杀出重围，得到了去世锦赛的资格。2012年，FTC世锦赛上我们拿到了迄今为止，FTC队伍在世锦赛的最好成绩：20强。2013年，我们 FTC 战队获得了全国最高奖启迪奖和冠军队长。2017年，我们的两只 FTC 队伍 「Volt」「Candela」赛季积分分列全国第一第二，在2017年 VEX世锦赛上，我们获得了表彰在结构和程序上都表现出色的最高技术奖评审奖。我们获得的其他奖项，太多太多，无法一一说清。这都是我们辛勤付出的成果。这些年来不断发展，我们机社的战队已经有丰富的经验与悠久的历史，希望接下来我们不断进步，超越自我！","categories":[{"name":"简介","slug":"简介","permalink":"http://yoursite.com/categories/简介/"}],"tags":[{"name":"伏特的故事","slug":"伏特的故事","permalink":"http://yoursite.com/tags/伏特的故事/"}]}]}